{
  "content": null,
  "embeds": [
    {
      "color": 15969533,
      "image": {
        "url": "https://cdn.discordapp.com/attachments/727293343385518215/822137859486122014/Banner_rules.png"
      }
    },
    {
      "title": "K-On! Discord Rules Annex A\nPlease read this section carefully.",
      "description": "**:pushpin: Follow the Discord Terms of Services & Guidelines.**\nSevere violations will result in a immediate ban. This includes but is not limited to being under the age of 13, Modification of client & Raiding.\n\n**:small_orange_diamond: [Discord Terms](https://discordapp.com/terms)**\n**:small_orange_diamond: [Discord Guidelines](https://discordapp.com/guidelines)**\n\n**:pushpin: Be respectful, avoid potentially sensitive or awkward topics.**\nTo keep this community welcoming for anyone; Harassment, Toxicity and Discrimination will not be tolerated. If you have a issue with another user, please handle it in your DMs rather than settling your disputes in our server.\n\n**:pushpin: Roleplaying and Excessive flirting should remain in DMs, this is not a dating server.**\n\n**:pushpin: Do not post NSFW or unsafe content.**\nPosting media that contains or heavily alludes to NSFW or NSFL content is forbidden. IP loggers, viruses, and any other file that does not embed into discord should be refrained from being posted in this server.\n\n**:pushpin: Do not advertise. Do not post links to other Discord servers or to promote yourself.**\nThis includes asking users to like/subscribe/donate/ect to you or another individual. This rule extends to your DMs with other server members.\n\n**:pushpin: Do not spam.**\nAvoid messages that are designed to flood the chat, such as copy-pastas & rapid message sending.\n\n**:pushpin: No inappropriate avatar.**\nPresent yourself with a proper nickname and profile picture. Engage in civilized speech and manner.\n\n**:pushpin: No negative talk. Racist, trolling, flaming, and/or any other destructive speech and material are prohibited. Casual jokes are fine.**",
      "color": 15969533
    },
    {
      "title": "Annex B",
      "description": "**:pushpin: Do not attempt to take advantage of any loop-holes within the rules.**\nDo not attempt to find loopholes in these rules or bypass the auto-mod system. Repeatedly almost violating the rules or \"Toeing the line\" is not permitted.\n\n**:pushpin: The staff team reserves the right to make any decision they see fit to keep the server running smoothly.**\n“Not breaking any of the rules” does not excuse you from purposefully degrading the server’s quality.\n\n**:pushpin: Spoilers should be kept out of all chats other than the appropriate channels.**\nNo point ruining the show for those yet to see it.\n\n**:pushpin: Alternate languages should be kept to a minimum.**\nFor the sake of conversation flow and common understanding, please stick to English.\n\n**:pushpin: Controversial topics should be kept out of the server.**\nThis can include Political, religious discussions etc.\nNSFW topics or conversations with NSFW nature is strictly not allowed.",
      "color": 15969533
    },
    {
      "color": 15969533,
      "image": {
        "url": "https://cdn.discordapp.com/attachments/727293343385518215/822137875843121212/Roles_test.png"
      }
    },
    {
      "title": "Server Roles",
      "description": "**<@&727293343352225858> -Server Moderators/Admins\n<@&727328848584114219> -Server Boosters\n<@&731996867063316480> -Event hosters\n<@&746539577321324544> -Contributors\n\nRoles obtainable through activity:\n<@&746941732742103141> [Level 50]\n<@&746941657093505064> [Level 40]\n<@&728434081448198234> [Level 30]\n<@&728434080844349511> [Level 20]\n<@&728254411620614204> [Level 15]\n<@&728254407380172911> [Level 10]\n<@&728254403252977695> [Level 5]\n\nCharacter/Other Roles\n[Obtainable in <#727293344136560782>]**\n\n__Custom roles can be obtained by boosting the server or through giveaway__",
      "color": 15969533
    }
  ]
}