{
  "content": null,
  "embeds": [
    {
      "color": 16363519,
      "image": {
        "url": "https://cdn.discordapp.com/attachments/846360035172679781/846404124269346826/Rules_and_Info_Final.png"
      }
    },
    {
      "description": ":pushpin: **Please follow both the Discord Community Guidelines and the Discord Terms of Service at all times. These can be found here:**\n<https://discord.com/guidelines>\n<https://discord.com/terms>\n\n:pushpin: **Please remain civil and respectful at all times. Discriminatory language against anyone on the basis of race, gender, sexuality or any other characteristic is not allowed, and slurs of any kind will not be tolerated.**\n\n:pushpin: **Please refrain from trolling and baiting, and avoid topics which may be sensitive or inflammatory.**\n\n:pushpin: **Please keep roleplaying and excessive flirting to more appropriate places.**\n\n:pushpin: **Please do not post any non work-safe images or content.**\n\n:pushpin: **Please ensure your profile picture and nickname does not contain anything which violates our rules.**\n\n:pushpin: **Please refrain from unsolicited advertising. This includes things such as links to other Discord servers, and personal Twitch or YouTube channels.**\n\n:pushpin: **Please do not post spam or attempt to flood any channels. Spam includes nonsensical or off-topic posts, posting memes outside of the proper channel, and chaining emojis.**\n\n:pushpin: **Please keep alternate languages to a minimum. English is the common language shared by both our community and our staff.**\n\n:pushpin: **Please do not attempt to take advantage of any loopholes in the rules. The staff team reserves the right to take any action it deems fit to keep the server running smoothly.**\n\n**These rules may be changed at any time without prior warning. For an in-depth version of these rules, please** __**[click here](https://docs.google.com/document/d/1WX5p0lpnGK-jpWl10W7ejKI-EjN6h475mHdL6R5AHys)**__",
      "color": 16363519
    },
    {
      "title": "Important Links",
      "description": "Permanent Discord Invite: https://discord.gg/NsJ6S3W\nVanity Invite Link: https://discord.gg/kon\nReddit Link: https://www.reddit.com/r/k_on/\nWiki Link: https://k-on.fandom.com/wiki/K-ON!_Wiki",
      "color": 16363519
    }
  ]
}